In [7]:
import numpy as np
import pandas as pd

In [10]:
from numpy.random import randn

In [11]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [12]:
df

          W         X         Y         Z
A  0.236955 -1.081037  1.301830 -1.055838
B  0.003476  0.608464 -0.301903 -1.122593
C -0.853136  0.183844  0.416154  1.630564
D  0.323705 -0.728692 -1.054567 -0.997311
E -0.622020 -0.883367 -0.477937 -0.224794

In [13]:
df['W']

A    0.236955
B    0.003476
C   -0.853136
D    0.323705
E   -0.622020
Name: W, dtype: float64

In [15]:
df[['W','Y']]

          W         Y
A  0.236955  1.301830
B  0.003476 -0.301903
C -0.853136  0.416154
D  0.323705 -1.054567
E -0.622020 -0.477937

In [16]:
df['new'] = df['W']+df['Y']

In [17]:
df

          W         X         Y         Z       new
A  0.236955 -1.081037  1.301830 -1.055838  1.538786
B  0.003476  0.608464 -0.301903 -1.122593 -0.298427
C -0.853136  0.183844  0.416154  1.630564 -0.436982
D  0.323705 -0.728692 -1.054567 -0.997311 -0.730862
E -0.622020 -0.883367 -0.477937 -0.224794 -1.099957

In [26]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.236955 -1.081037  1.301830 -1.055838
B  0.003476  0.608464 -0.301903 -1.122593
C -0.853136  0.183844  0.416154  1.630564
D  0.323705 -0.728692 -1.054567 -0.997311
E -0.622020 -0.883367 -0.477937 -0.224794

In [28]:
#Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [29]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [30]:
df

             A         B
G1 1 -0.590677 -1.452513
   2  0.269079 -0.334341
   3 -0.874891 -1.202018
G2 1 -0.040906 -0.420337
   2 -0.541033  0.490628
   3 -0.010126  2.153042

In [31]:
df.loc['G1']

          A         B
1 -0.590677 -1.452513
2  0.269079 -0.334341
3 -0.874891 -1.202018

In [35]:
df.loc['G1'].loc[2]

A    0.269079
B   -0.334341
Name: 2, dtype: float64

In [36]:
df.index.names = ['Groups','Num']

In [37]:
df

                   A         B
Groups Num
G1     1   -0.590677 -1.452513
       2    0.269079 -0.334341
       3   -0.874891 -1.202018
G2     1   -0.040906 -0.420337
       2   -0.541033  0.490628
       3   -0.010126  2.153042

In [39]:
df.loc['G2']

            A         B
Num
1   -0.040906 -0.420337
2   -0.541033  0.490628
3   -0.010126  2.153042

In [41]:
df.loc['G2'].loc[3].loc['A']

-0.010125526053729246

In [42]:
df

                   A         B
Groups Num
G1     1   -0.590677 -1.452513
       2    0.269079 -0.334341
       3   -0.874891 -1.202018
G2     1   -0.040906 -0.420337
       2   -0.541033  0.490628
       3   -0.010126  2.153042

In [43]:
#Cross section data
df.xs(1,level='Num')

               A         B
Groups
G1     -0.590677 -1.452513
G2     -0.040906 -0.420337